[
	{
		"title": "The Come Up"
		, "discription": "The Come Up is the first mixtape from North Carolina rapper J. Cole released on May 4, 2007, hosted by DJ OnPoint. The mixtape has been downloaded and streamed over 300,000 times, while being viewed over 1,274,000 times on mixtape site DatPiff."
		, "AlbumArtUrl": "http://4.bp.blogspot.com/_zhTSVuwwoNE/TF-hmiqYZbI/AAAAAAAAAEY/Z0pj06Njt0Q/s1600/The+Come+Up+(Hosted+By+DJ+On+Point)+3.jpg"
		, "wikiLink": "https://en.wikipedia.org/wiki/The_Come_Up"
		, "embendedPlayer": "https://embed.spotify.com/?uri=spotify%3Aalbum%3A3bgYigYVfRCIsE3lm1GQga"
}
	, {
		"title": "The Warm Up"
		, "discription": "The Warm Up is the second official mixtape from Fayetteville, North Carolina rapper J. Cole. J. Cole and The R.E.C produced the majority of the mixtape with help from Elite, Syience, and E.k.n. The mixtape has been viewed over 3,100,000 times, streamed over 451,000 times, and downloaded over 550,000 times on DatPiff."
		, "AlbumArtUrl": "http://static.vibe.com/files/article_images/J-Cole-The-Warm-Up.jpg"
		, "wikiLink": "https://en.wikipedia.org/wiki/The_Warm_Up"
		, "embendedPlayer": "https://embed.spotify.com/?uri=spotify%3Auser%3A1138212436%3Aplaylist%3A7g5VTTX3DKjb52aQOhuetT"
	}
	, {
		"title": "Friday Night Lights"
		, "discription": "Friday Night Lights is the third official mixtape from Fayetteville, North Carolina rapper J. Cole. It was released on November 12, 2010. The mixtape was to originally be called Villematic and contain J. Cole's previous leaks and freestyles, however, Cole later stated it would have original material. The mixtape became the second most searched and trending topics on Google and Twitter respectively following its release. Most songs on the mixtape were slated to be on his debut album at one point or another. The mixtape has been viewed over 4,470,000 times, streamed over 1,280,000 times, and downloaded over 1,700,000 times on mixtape site DatPiff. On June 26, 2013 Cole announced that he would be re-releasing The Warm Up and Friday Night Lights for retail sale, in order to give them the push they deserved."
		, "AlbumArtUrl": "http://bespokemag.co.uk/wp-content/uploads/2015/11/fnl.jpg"
		, "wikiLink": "https://en.wikipedia.org/wiki/Friday_Night_Lights_(mixtape)"
		, "embendedPlayer": "http://www.datpiff.com/embed/mfcbaee6/"
	}
	, {
		"title": "Cole World: The Sideline Story"
		, "discription": "Cole World: The Sideline Story (commonly shortened to Cole World or The Sideline Story) is the debut studio album by American rapper J. Cole. The album was released on September 27, 2011 under Roc Nation and Columbia Records with distribution from Sony Music. The album is his first studio release, following three successful mixtapes. Production was handled mainly by Cole himself, with some production from high-profile producer No I.D. It includes features from Trey Songz, Drake, Jay-Z, and Missy Elliott. The album debuted at number one on the US Billboard 200 chart, with 218,000 copies sold in the first week following its release. The album has since been certified Platinum by the Recording Industry Association of America (RIAA). As of December 2016, it has sold 855,000 copies in the United States."
		, "AlbumArtUrl": "http://images.rapgenius.com/3cgkifu1zzc0hjclvad6k1tov.1000x1000x1.jpg"
		, "wikiLink": "https://en.wikipedia.org/wiki/Cole_World:_The_Sideline_Story"
		, "embendedPlayer": "https://embed.spotify.com/?uri=spotify%3Aalbum%3A4skqOUXyBUnzxVPNPxrGWV"
}, {
		"title": "Born Sinner"
		, "discription": "Born Sinner is the second studio album by American hip hop recording artist J. Cole. It was released on June 18, 2013, by Dreamville Records, ByStorm Entertainment, Roc Nation and Columbia Records with distribution from Sony Music. The album serves as the follow-up to his debut album, Cole World: The Sideline Story (2011). The album features guest appearances from Miguel, Amber Coffman, Jhené Aiko, James Fauntleroy, Bas, TLC, Kendrick Lamar and 50 Cent. The album was also primarily produced by Cole himself, along with others such as Jake One, Syience, Christian Rich and Elite."
		, "AlbumArtUrl": "http://beginningandend.com/wp-content/uploads/2013/06/J-Cole-Born-Sinner-Devil-Head-Illuminati-Satanic-Sybolism.jpg"
		, "wikiLink": "https://en.wikipedia.org/wiki/Born_Sinner"
		, "embendedPlayer": "https://embed.spotify.com/?uri=spotify%3Aalbum%3A1NfrmcXk8xNennyxQ57JcW"
	},

	{
		"title": "Truly Yours and Truly Yours 2"
		, "discription": "Truly Yours and Truly Yours 2 are the first and second extended plays by American hip hop artist J. Cole. They were released digitally for free download and stream on February 12 and April 30 of 2013. The series consists of songs that Cole knew would not make the cutlist for Born Sinner. Truly Yours 2 features guest appearances from Young Jeezy, 2 Chainz and Bas. The free EP was released as a trilogy, with the third being released as the deluxe edition of Born Sinner. Both projects have over 500,000 downloads on mixtape site DatPiff."
		, "AlbumArtUrl": "https://upload.wikimedia.org/wikipedia/en/9/98/Cole-Truly-Yours.jpeg"
		, "wikiLink": "https://en.wikipedia.org/wiki/Truly_Yours_(EP)"
		, "embendedPlayer": "http://www.datpiff.com/embed/m1b69e16/"
		, "embendedPlayer2": "http://www.datpiff.com/embed/m1a9b68a/"
	}
	, {
		"title": "2014 Forest Hills Drive"
		, "discription": "2014 Forest Hills Drive is the third studio album by American hip hop recording artist J. Cole. It was released on December 9, 2014, by Dreamville Records, ByStorm Entertainment, Roc Nation and Columbia Records. Recording sessions took place over the whole year, while the production on the album was primarily handled by Cole himself, along with several others such as Illmind, Vinylz, Phonix Beats and Willie B. It was announced three weeks before its release and had very little marketing, with no singles or promotion taking place prior to its release. The album was supported by four singles:' Apparently', 'Wet Dreamz', 'No Role Modelz' and 'Love Yourz'."
		, "AlbumArtUrl": "https://images.genius.com/7154c6dafd6f6f883c099f033a4aa5e3.1000x1000x1.jpg"
		, "wikiLink": "https://en.wikipedia.org/wiki/2014_Forest_Hills_Drive"
		, "embendedPlayer": "https://embed.spotify.com/?uri=spotify%3Aalbum%3A7viNUmZZ8ztn2UB4XB3jIL"
	}
	, {
		"title": "4 Your Eyez Only"
		, "discription": "4 Your Eyez Only is the fourth studio album by American hip hop recording artist J. Cole. It was released on December 9, 2016, by Dreamville Records, Roc Nation and Interscope Records, serving as Cole's first release with Interscope. Most of the recording on the album took place at the Sheltuh in North Carolina and Electric Lady Studios in New York City. Production was primarily handled by Cole himself, alongside several other record producers such as Vinylz, Boi-1da, Cardiak, Ron Gilmore, Frank Dukes, Chargaux and Elite among others. The album was released exactly two years after Cole's previous studio album, 2014 Forest Hills Drive."
		, "AlbumArtUrl": "http://dreamville.com/wp-content/uploads/2016/12/4UEO_Cvr-e1480572866398.jpg"
		, "wikiLink": "https://en.wikipedia.org/wiki/4_Your_Eyez_Only"
		, "embendedPlayer": "https://embed.spotify.com/?uri=spotify%3Aalbum%3A71DEqZQPK1OhGtZ9bNtbcc"
	}]
